app/Http/Controllers/Controller.php

    public function index()
    {


        $connection = DB::getDefaultConnection();
        if ($connection == 'school' && Auth::user()) {
            return redirect('/dashboard');
        }
        DB::setDefaultConnection('mysql');
        Session::forget('school_database_name');
        Session::put('school_database_name', null);

        if (Auth::user() && (Auth::user()->two_factor_enabled == 1 && Auth::user()->two_factor_expires_at)) {
            return redirect('/dashboard');
        }

        if (Auth::user()) {
            return redirect('/dashboard');
        }
        $currentDatabaseName = DB::connection()->getDatabaseName();
        // School website
        $fullDomain = $_SERVER['HTTP_HOST'];
        $fullDomain = str_replace("www.", "", $fullDomain);
        $parts = explode('.', $fullDomain);
        $subdomain = $parts[0];
        $school = '';
        $extraFields = [];
        $demoSchoolUrl = '';
        $isDemoSchool = 0;
        try {
            $demoDomain = School::where('type', 'demo')->pluck('domain')->first();
---
select `domain` from `schools` where `type` = 'demo' and `schools`.`deleted_at` is null

        }

        try {
            $school = School::on('mysql')->where('domain', $fullDomain)->orwhere('domain', $subdomain)->where('installed', 1)->first();
---
select * from `schools` where (`domain` = 'ta3limx.homiacare.com' or `domain` = 'ta3limx' and `installed` = 1) and `schools`.`deleted_at` is null limit 1

            $features = Feature::activeFeatures()->get();

            $settings = app(CachingService::class)->getSystemSettings();
            $schoolSettings = SchoolSetting::where('name', 'horizontal_logo')->get();

            $about_us_lists = $settings['about_us_points'] ?? 'Affordable price, Easy to manage admin panel, Data Security';
            $about_us_lists = explode(",", $about_us_lists);
            $faqs = Faq::where('school_id', null)->get();
            $featureSections = FeatureSection::with('feature_section_list')->orderBy('rank', 'ASC')->get();
            $guidances = $this->guidance->builder()->get();
            $languages = Language::get();

            $school = School::count();
            $allSchools = School::all();
---
select * from `school_settings` where `name` = 'horizontal_logo'
select * from `faqs` where `school_id` is null
select * from `feature_section_lists` where `feature_section_lists`.`feature_section_id` in (1)
select * from `feature_sections` order by `rank` asc
select * from `guidances`
select * from `languages`
select count(*) as aggregate from `schools` where `schools`.`deleted_at` is null
select * from `schools` where `schools`.`deleted_at` is null

                'teacher' => $teacher,
            ];

            $packages = Package::where('status', 1)->with('package_feature.feature')->where('status', 1)->orderBy('rank', 'ASC')->get();
---
select * from `features` where `features`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21)
select * from `package_features` where `package_features`.`package_id` in (2, 3, 4)
select * from `packages` where `status` = 1 and `status` = 1 and `packages`.`deleted_at` is null order by `rank` asc

                $trail_package = $trail_package->id;
            }

            $extraFields = $this->formFields->defaultModel()->orderBy('rank')->get();
---
select * from `form_fields` where `form_fields`.`deleted_at` is null order by `rank` asc