app/Http/Controllers/DashboardController.php

select * from `schools` where `schools`.`deleted_at` is null
select count(*) as aggregate from `packages` where `is_trial` = 0 and `packages`.`deleted_at` is null
---
            'deactive_school' => 0,
        ];
        if (Auth::user()->hasRole('Super Admin') || !Auth::user()->school_id) {
            $school = $this->school->builder()->get();
            $total_school = $school->count();
            $active_school = $school->where('status', 1)->count();
            $deactive_school = $school->where('status', 0)->count();
            $packages = Package::where('is_trial', 0)->count();

select `id`, `first_name`, `last_name` from `users` where `users`.`id` in (2, 3, 4, 5)
select `id`, `name`, `admin_id`, `logo` from `schools` where `schools`.`deleted_at` is null order by `id` desc limit 5
---
                $start_year = Carbon::now()->format('Y');
            }

            $schools = $this->school->builder()->select('id', 'name', 'admin_id', 'logo')->with('user:id,first_name,last_name')->orderBy('id', 'DESC')->take(5)->get();