app/Http/Controllers/SchoolController.php

select * from `schools` where `schools`.`deleted_at` is null order by `created_at` desc limit 1
select * from `schools` where `type` = 'demo' limit 1
select * from `form_fields` where `form_fields`.`deleted_at` is null order by `rank` asc
---
    public function index()
    {
        ResponseService::noPermissionThenRedirect('schools-list');
        $packages = $this->package->builder()->orderBy('rank')->get()->pluck('package_with_type', 'id')->toArray();

        $baseUrl = url('/');
        // Remove the scheme (http:// or https://)
        $baseUrlWithoutScheme = preg_replace("(^https?://)", "", $baseUrl);
        $baseUrlWithoutScheme = str_replace("www.", "", $baseUrlWithoutScheme);

        $schools = $this->schoolsRepository->builder()->latest()->first();
        try {
            $demoSchool = $this->schoolsRepository->builder()->where('type', 'demo')->withTrashed()->first() !== null ? 1 : 0;
        } catch (\Exception $e) {
            $demoSchool = 0;
        }

        $school_code = date('Y') . (($schools->id ?? 0) + 1);
        $settings = $this->cache->getSystemSettings();

        $prefix = $settings['school_code_prefix'] ?? 'SCH';

        $email_verified = $settings['email_verified'] ? 1 : 0;

        $extraFields = $this->formFields->defaultModel()->orderBy('rank')->get();